In [70]:
import numpy as np
import pandas as pd

In [71]:
data={"Name":["raisa","mubin","ayesha","mahira"],
     "age":[28,22,30,2],"marks":[80,90,87,60]}

# data

In [72]:
df=pd.DataFrame(data,index=['a','b','c','d'])
df

     Name  age  marks
a   raisa   28     80
b   mubin   22     90
c  ayesha   30     87
d  mahira    2     60

# Summary: and apply stat on df

In [73]:
df.sum()#sum of column

Name     raisamubinayeshamahira
age                          82
marks                       317
dtype: object

In [74]:
df.sum(axis=1)#sum of rows

a    108
b    112
c    117
d     62
dtype: int64

In [42]:
#### if i want only single column and i want to perform sum()

In [75]:
df[["age"]].sum()

age    82
dtype: int64

In [76]:
df["age"].sum()

82

In [77]:
df[["age","marks"]].sum()

age       82
marks    317
dtype: int64

In [78]:
df.loc[:,["age","marks"]].sum()

age       82
marks    317
dtype: int64

In [79]:
df

     Name  age  marks
a   raisa   28     80
b   mubin   22     90
c  ayesha   30     87
d  mahira    2     60

In [80]:
df.drop(columns='Name')

   age  marks
a   28     80
b   22     90
c   30     87
d    2     60

In [81]:
df.iloc[:2,:3]

    Name  age  marks
a  raisa   28     80
b  mubin   22     90

In [82]:
df.iloc[0:2,1:3]

   age  marks
a   28     80
b   22     90

In [83]:
df

     Name  age  marks
a   raisa   28     80
b   mubin   22     90
c  ayesha   30     87
d  mahira    2     60

In [84]:

df.mean()["age"]

20.5

In [86]:
df.mean()["marks"]

79.25

In [87]:
df.mode()["marks"]

0    60
1    80
2    87
3    90
Name: marks, dtype: int64

In [88]:
df.mode()["age"]

0     2
1    22
2    28
3    30
Name: age, dtype: int64

In [89]:
df.median()["age"]

25.0

In [90]:
df.median()["marks"]

83.5

In [91]:
df

     Name  age  marks
a   raisa   28     80
b   mubin   22     90
c  ayesha   30     87
d  mahira    2     60

In [92]:

df.cumsum()['marks']

a     80
b    170
c    257
d    317
Name: marks, dtype: int64

In [93]:
df.cummax()['marks']

a    80
b    90
c    90
d    90
Name: marks, dtype: int64

In [94]:
df

     Name  age  marks
a   raisa   28     80
b   mubin   22     90
c  ayesha   30     87
d  mahira    2     60

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   age     4 non-null      int64
 2   marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [96]:
df.describe().T

       count   mean        std   min   25%   50%    75%   max
age      4.0  20.50  12.793227   2.0  17.0  25.0  28.50  30.0
marks    4.0  79.25  13.500000  60.0  75.0  83.5  87.75  90.0

In [97]:
df.describe().T[["min","max"]]

        min   max
age     2.0  30.0
marks  60.0  90.0

# Manipulation of DataFrame: How to add rows

In [98]:
import numpy as np
import pandas as pd
# list of tuples
student=[("jack",45,"pune","HR",30000),("raisa",28,"ich","principal",50000),("ayesha",30,"patan","Developer",60000)]

In [99]:
student

[('jack', 45, 'pune', 'HR', 30000),
 ('raisa', 28, 'ich', 'principal', 50000),
 ('ayesha', 30, 'patan', 'Developer', 60000)]

In [100]:
df=pd.DataFrame(student,columns=["Name","age","location","post","salary"])
df

     Name  age location       post  salary
0    jack   45     pune         HR   30000
1   raisa   28      ich  principal   50000
2  ayesha   30    patan  Developer   60000

In [101]:
df.head(1)

   Name  age location post  salary
0  jack   45     pune   HR   30000

In [102]:
df1=df.append({"Name":"mahi","age":2})#here ignore_index is false, for key value pair it must be true
df1

TypeError: Can only append a dict if ignore_index=True

In [103]:
df1=df.append({"Name":"mahi","age":2},ignore_index=True)
df1

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3    mahi    2      NaN        NaN      NaN

In [104]:
df1

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3    mahi    2      NaN        NaN      NaN

# dataframe.append() and Series

In [105]:
s = pd.Series(['Raju', 21, 'Bangalore', 'India'],index=['Name','age','location','post'] )
s

Name             Raju
age                21
location    Bangalore
post            India
dtype: object

In [106]:
df.append(s,ignore_index=True)

     Name  age   location       post   salary
0    jack   45       pune         HR  30000.0
1   raisa   28        ich  principal  50000.0
2  ayesha   30      patan  Developer  60000.0
3    Raju   21  Bangalore      India      NaN

In [107]:
r = pd.Series(['Rohit',23,'Paris','US'])
r

0    Rohit
1       23
2    Paris
3       US
dtype: object

In [108]:
df.append(r,ignore_index=True)

     Name   age location       post   salary      0     1      2    3
0    jack  45.0     pune         HR  30000.0    NaN   NaN    NaN  NaN
1   raisa  28.0      ich  principal  50000.0    NaN   NaN    NaN  NaN
2  ayesha  30.0    patan  Developer  60000.0    NaN   NaN    NaN  NaN
3     NaN   NaN      NaN        NaN      NaN  Rohit  23.0  Paris   US

In [109]:
r = pd.Series(['Rohit',23,'Paris','US'],index=['Name','age','location','post'])
r

Name        Rohit
age            23
location    Paris
post           US
dtype: object

In [110]:
df.append(r,ignore_index=True)

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3   Rohit   23    Paris         US      NaN

In [111]:
df.columns

Index(['Name', 'age', 'location', 'post', 'salary'], dtype='object')

In [112]:
listofseries=[pd.Series(['Raju', 21, 'Bangalore', 'India',55], index=df.columns ),pd.Series(['Sam', 22, 'Tokyo', 'Japan',66], index=df.columns ) ,
                pd.Series(['Rocky', 23, 'Las Vegas', 'US',87], index=df.columns ) ]
listofseries

[Name             Raju
 age                21
 location    Bangalore
 post            India
 salary             55
 dtype: object,
 Name          Sam
 age            22
 location    Tokyo
 post        Japan
 salary         66
 dtype: object,
 Name            Rocky
 age                23
 location    Las Vegas
 post               US
 salary             87
 dtype: object]

In [113]:
# Pass a list of series to the append() to add multiple rows
df.append(listofseries)

     Name  age   location       post  salary
0    jack   45       pune         HR   30000
1   raisa   28        ich  principal   50000
2  ayesha   30      patan  Developer   60000
0    Raju   21  Bangalore      India      55
1     Sam   22      Tokyo      Japan      66
2   Rocky   23  Las Vegas         US      87

In [114]:
df.append(listofseries,ignore_index=True)#due to this row ka index chk karo

     Name  age   location       post  salary
0    jack   45       pune         HR   30000
1   raisa   28        ich  principal   50000
2  ayesha   30      patan  Developer   60000
3    Raju   21  Bangalore      India      55
4     Sam   22      Tokyo      Japan      66
5   Rocky   23  Las Vegas         US      87

# Add a row from one dataframe to other datafram

In [115]:
 #List of Tuples
studentslist=[("rijwan",23,"Ich",'HR',56),("rijwan1",23,"Ich",'HR',56),("rijwan2",23,"Ich",'HR',56)]
studentslist

[('rijwan', 23, 'Ich', 'HR', 56),
 ('rijwan1', 23, 'Ich', 'HR', 56),
 ('rijwan2', 23, 'Ich', 'HR', 56)]

In [116]:
df.columns

Index(['Name', 'age', 'location', 'post', 'salary'], dtype='object')

In [117]:
df2=pd.DataFrame(studentslist,columns = df.columns, index=['a', 'b','c'])
df2

      Name  age location post  salary
a   rijwan   23      Ich   HR      56
b  rijwan1   23      Ich   HR      56
c  rijwan2   23      Ich   HR      56

In [118]:
df.append(df2,ignore_index=True
)

      Name  age location       post  salary
0     jack   45     pune         HR   30000
1    raisa   28      ich  principal   50000
2   ayesha   30    patan  Developer   60000
3   rijwan   23      Ich         HR      56
4  rijwan1   23      Ich         HR      56
5  rijwan2   23      Ich         HR      56

In [119]:
df

     Name  age location       post  salary
0    jack   45     pune         HR   30000
1   raisa   28      ich  principal   50000
2  ayesha   30    patan  Developer   60000

In [120]:
df2

      Name  age location post  salary
a   rijwan   23      Ich   HR      56
b  rijwan1   23      Ich   HR      56
c  rijwan2   23      Ich   HR      56

In [121]:
df2.loc['a']

Name        rijwan
age             23
location       Ich
post            HR
salary          56
Name: a, dtype: object

In [122]:
df.iloc[:1]# 1 is exclusive

   Name  age location post  salary
0  jack   45     pune   HR   30000

In [123]:
df.iloc['a']

TypeError: Cannot index by location index with a non-integer key

In [124]:
df.iloc[1]#1

Name            raisa
age                28
location          ich
post        principal
salary          50000
Name: 1, dtype: object

In [125]:
df.loc[:1]#['Name']# 1 is inclusive

    Name  age location       post  salary
0   jack   45     pune         HR   30000
1  raisa   28      ich  principal   50000


# how to add rows without append

In [126]:
df

     Name  age location       post  salary
0    jack   45     pune         HR   30000
1   raisa   28      ich  principal   50000
2  ayesha   30    patan  Developer   60000

In [127]:
df.loc[3]=["rijwan",23,'pune','DR',70000]
df

     Name  age location       post  salary
0    jack   45     pune         HR   30000
1   raisa   28      ich  principal   50000
2  ayesha   30    patan  Developer   60000
3  rijwan   23     pune         DR   70000

In [128]:
df2

      Name  age location post  salary
a   rijwan   23      Ich   HR      56
b  rijwan1   23      Ich   HR      56
c  rijwan2   23      Ich   HR      56

In [129]:
df2.iloc[:2]

      Name  age location post  salary
a   rijwan   23      Ich   HR      56
b  rijwan1   23      Ich   HR      56

In [130]:
df2.iloc['a']=["rijwan",23,'pune','DR',70000]
df2

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [131]:
df2

      Name  age location post  salary
a   rijwan   23      Ich   HR      56
b  rijwan1   23      Ich   HR      56
c  rijwan2   23      Ich   HR      56

In [132]:
# Add a new row at index position 2 with values provided in list
df2.loc['a']=['Mukesh', 255, 'Chennai', 'India',50000]
df2

      Name  age location   post  salary
a   Mukesh  255  Chennai  India   50000
b  rijwan1   23      Ich     HR      56
c  rijwan2   23      Ich     HR      56

In [133]:
df1.append(r,ignore_index=True)
df1

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3    mahi    2      NaN        NaN      NaN

In [134]:
df1

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3    mahi    2      NaN        NaN      NaN

In [135]:
df1[0:4]

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3    mahi    2      NaN        NaN      NaN

In [136]:
df1[0:1]

   Name  age location post   salary
0  jack   45     pune   HR  30000.0

In [137]:
df1

     Name  age location       post   salary
0    jack   45     pune         HR  30000.0
1   raisa   28      ich  principal  50000.0
2  ayesha   30    patan  Developer  60000.0
3    mahi    2      NaN        NaN      NaN

# Addition of column

In [138]:
df1['no']=[1,2,3,4]
df1

     Name  age location       post   salary  no
0    jack   45     pune         HR  30000.0   1
1   raisa   28      ich  principal  50000.0   2
2  ayesha   30    patan  Developer  60000.0   3
3    mahi    2      NaN        NaN      NaN   4

In [139]:
df1['no']=[1,2,3,4]
df1

     Name  age location       post   salary  no
0    jack   45     pune         HR  30000.0   1
1   raisa   28      ich  principal  50000.0   2
2  ayesha   30    patan  Developer  60000.0   3
3    mahi    2      NaN        NaN      NaN   4

In [140]:
import numpy as np
df1['rand']=np.random.random(4)
df1

     Name  age location       post   salary  no      rand
0    jack   45     pune         HR  30000.0   1  0.621893
1   raisa   28      ich  principal  50000.0   2  0.184100
2  ayesha   30    patan  Developer  60000.0   3  0.768597
3    mahi    2      NaN        NaN      NaN   4  0.929139

In [141]:
df1.iloc[:2]

    Name  age location       post   salary  no      rand
0   jack   45     pune         HR  30000.0   1  0.621893
1  raisa   28      ich  principal  50000.0   2  0.184100

In [142]:
df1.iloc[2]=df1['no']
df1

ValueError: Must have equal len keys and value when setting with an iterable

# delete

In [143]:
df1

     Name  age location       post   salary  no      rand
0    jack   45     pune         HR  30000.0   1  0.621893
1   raisa   28      ich  principal  50000.0   2  0.184100
2  ayesha   30    patan  Developer  60000.0   3  0.768597
3    mahi    2      NaN        NaN      NaN   4  0.929139

In [144]:
del df1['rand']

In [145]:
df1

     Name  age location       post   salary  no
0    jack   45     pune         HR  30000.0   1
1   raisa   28      ich  principal  50000.0   2
2  ayesha   30    patan  Developer  60000.0   3
3    mahi    2      NaN        NaN      NaN   4

In [153]:
df1.pop('age')

0    45
1    28
2    30
3     2
Name: age, dtype: int64

In [154]:
df1

     Name location   salary  no
0    jack     pune  30000.0   1
1   raisa      ich  50000.0   2
2  ayesha    patan  60000.0   3
3    mahi      NaN      NaN   4

In [ ]:
 #to delete a single row
 #to delete collection of rows

In [161]:

df1.drop([0,1])

     Name location   salary  no
2  ayesha    patan  60000.0   3
3    mahi      NaN      NaN   4

In [162]:
df1

     Name location   salary  no
0    jack     pune  30000.0   1
1   raisa      ich  50000.0   2
2  ayesha    patan  60000.0   3
3    mahi      NaN      NaN   4

In [167]:
import numpy as np

In [171]:
df1 = df1.drop(np.random.randint(3))# to delete random rows

In [172]:
df1

    Name location   salary  no
1  raisa      ich  50000.0   2
3   mahi      NaN      NaN   4